using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.IO;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace LearningBiology
{
    public partial class Quiz : Form
    {
        public Quiz()
        {
            InitializeComponent();
        }

        string[] qArr = {
           "Η ικανότητα του οργανισμού να διατηρεί σταθερές τις συνθήκες του εσωτερικού του περιβάλλοντος παρά τις εξωτερικές μεταβολές ονομάζεται ... .",
           "Γενικά ως .... χαρακτηρίζονται εκείνοι οι οργανισμοί τους οποίους δεν μπορούμε να διακρίνουμε με γυμνό μάτι.",
           "Ποιοι οργανισμοί είναι προκαρυωτικοί.",
           "Οι .... χαρακτηρίζονται ως υποχρεωτικά ενδοκυτταρικά παράσιτα.",
           "Η είσοδος ενός παθογόνου μικροοργανισμού στον οργανισμό του ανθρώπου ονομάζεται .... .",
           "Η εγκατάσταση και ο πολλαπλασιασμός ενός παθογόνου μικροοργανισμού στον οργανισμό ονομάζεται ... .",
           "Οι ασθένειες που προκαλούνται από παθογόνους μικροοργανισμούς ονομάζονται .... .",
           "Πολλά βακτήρια απειλούν την υγεία μας μέσω των ουσιών που παράγουν. Οι ουσίες αυτές ονομάζονται ... .",
           "Πολλοί μικροοργανισμοί προκειμένου να επιβιώσουν και να αναπαραχθούν, περνούν ένα μέρος ή ολόκληρη την ζωή τους στο εσωτερικό κάποιου οργανισμού. Αυτοί οι μικροοργανισμοί ονομάζονται .... .",
           "Ο οργανισμός που φιλοξενεί τα παράσιτα ονομάζεται .... .",
           "Οι .... μικροοργανισμοί χρησιμοποιούν τον άνθρωπο ως ξενιστή τους και μπορούν να προκαλέσουν διαταραχές στην υγεία του.",
           "Το .... είναι πρωτόζωο που μεταδίδεται από τα κουνούπια και προκαλεί ελονοσία.",
           "Το .... μεταδίδεται από την μύγα τσετσέ και προκαλεί την ασθένεια του ύπνου.",
           "Το .... μεταδίδεται από τα κατοικίδια ζώα , προσβάλλει βασικά όργανα όπως τους πνεύμονες, το ήπαρ και το σπλήνα και προκαλεί αποβολές στις εγκύους.",
           "Τα .... αποτελούν μια ειδική κατηγορία μυκήτων που προσβάλλουν το δέρμα , κυρίως το τριχωτό της κεφαλής αλλά και τις μεσοδακτύλιες περιοχές.",
           "Οι ιοί αποτελούνται από ένα πρωτεϊνικό περίβλημα με χαρακτηριστική γεωμετρία, το .... .",
           "Ορισμένοι ιοί διαθέτουν και ένα περίβλημα λιποπρωτεϊνικής φύσης, το .... .",
           "Οι .... βρίσκονται στο κυτταρικό τοίχωμα ορισμένων παθογόνων βακτηρίων και είναι υπεύθυνες για συμπτώματα όπως ο πυρετός, η πτώση της πίεσης του αίματος κλπ.",
           "Οι .... εκκρίνονται από τα παθογόνα βακτήρια και με την κυκλοφορία του αίματος διασπείρονται στο εσωτερικό του ανθρώπινου οργανισμού και προσβάλλουν ανάλογα με την φύση τους, συγκεκριμένα όργανα.",
           "Τα Β-λεμφοκύτταρα συνθέτουν και παρουσιάζουν στην επιφάνεια τους ειδικές πρωτεΐνες που ονομάζονται .... .",
           "Το .... πρόκειται για ομάδα 20 πρωτεϊνών στον ορό του αίματος με αντιμικροβιακή δράση.",
           "Η .... είναι μία ομάδα 3 πρωτεϊνών στον ορό του αίματος που δρα σε συνδυασμό με τις πρωτεΐνες του συμπληρώματος για την καταστροφή των μικροβίων.",
           "Η .... είναι η ικανότητα του οργανισμού να θυμάται τα αντιγόνα με τα οποία έχει έλθει σε επαφή.",
           "Η ικανότητα του οργανισμού να αναγνωρίζει οποιαδήποτε ξένη ουσία και να αντιδρά παράγοντας εξειδικευμένα κύτταρα και κυτταρικά προϊόντα ώστε να την εξουδετερώσει ονομάζεται .... .",
           "Η ξένη ουσία που προκαλεί την ανοσοβιολογική απόκριση ονομάζεται .... .",
            "Η απεικόνιση των ποιοτικών τροφικών σχέσεων που αναπτύσσονται μεταξύ των οργανισμών ενός οικοσυστήματος γίνεται με τις ..... και τα τροφικά πλέγματα.",
        "Η απεικόνιση των ποσοτικών τροφικών σχέσεων γίνεται με τις .... .",
        "Το δίκτυο αυτό που απεικονίζει το σύνολο των τροφικών σχέσεων μεταξύ των οργανισμών ενός οικοσυστήματος , ονομάζεται .... .",
        "Μια τροφική πυραμίδα αποτελείται από .... , σε κάθε ένα από τα οποία περιλαμβάνονται όλοι οι οργανισμοί που τρέφονται απέχοντας ίδιο αριθμό βημάτων από τον ήλιο.",
        "Ποιό τροφικό επίπεδο βρίσκεται στην βάση της τροφικής πυραμίδας;",
        "Ποιό είναι το δεύτερο τροφικό επίπεδο;",
        "Ποιό είναι το τρίτο τροφικό επίπεδο;",
        "Οι επαναλαμβανόμενες κυκλικές πορείες των χημικών στοιχείων στα οικοσυστήματα χαρακτηρίζονται ως.... .",
        "Ο....είναι το χημικό στοιχείο με βάση το οποίο δομούνται όλες οι οργανικές ενώσεις και συνεπώς όλα τα βιολογικά μακρομόρια.",
        "Η εισαγωγή του ατμοσφαιρικού αζώτου στις τροφικές αλυσίδες των οικοσυστημάτων γίνεται με τη διαδικασία της.... .",
        "Κατά την .... αζωτοδέσμευση το άζωτο της ατμόσφαιρας αντιδρά είτε με τους υδρατμούς, σχηματίζοντας αμμωνία , είτε με το ατμοσφαιρικό οξυγόνο σχηματίζοντας νητρικά ιόντα.",
        "Η....αζωτοδέσμευση πραγματοποιείται από ελεύθερους ή συμβιωτικούς μικροοργανισμούς.",
        "Με την .... το νερό απομακρύνεται με τη μορφή υδρατμών από οποιαδήποτε επιφάνεια.",
        "Η εξάτμιση του νερού απο την επιφάνεια των φύλλων ονομάζεται .... εξάτμιση.",
        "Η....είναι η απομάκρυνση του νερού μέσω των στομάτων, των πόρων δηλαδή της επιδερμίδας των φύλλων.",
        "Οι....είναι οι οργανισμοί που φωτοσυνθέτουν.",
        "Όλοι οι οργανισμοί των οικοσυστημάτων , οι οποίοι δεν φωτοσυνθέτουν, χαρακτηρίζονται ως .... .",
        "Στους....ανήκουν ορισμένα βακτήρια και μύκητες που τρέφονται με τη νεκρή οργανική ύλη.",
        "Οι οργανισμοί ενός οικοσυστήματος οι οποίοι ανήκουν στο ίδιο είδος αποτελούν έναν .... .",
        "Το σύνολο των διαφορετικών πληθυσμών που ζουν σε ένα οικοσύστημα, αλλά και οι σχέσεις που αναπτύσονται μεταξύ τους αποτελούν την .... του οικοσυστήματος.",
        ".... είναι η περιοχή στην οποία ζει ένας πληθυσμός ή μια βιοκοινότητα.",
                 "Η .... θεωρία η οποία υποστηρίζει ότι όλα τα έμβια όντα αποτελούνται από κύτταρα και απο προϊόντα κυττάρων.",
          "Η .... υποστηρίζει ότι όλα τα έμβια όντα είναι προϊόν εξέλιξης που υπέστησαν προγενέστεροι οργανισμοί.",
          "Το .... περιλαμβάνει το σύνολο των διαφορετικών πληθυσμών.",
          "Για να παραμείνει σταθερό το μέγεθος ενός πληθυσμού παρά την τάση για αύξηση μερικά άτομα δεν επιβιώνουν ή δεν αναπαράγονται. Συνεπώς μεταξύ των οργανισμών ενός πληθυσμού διεξάγεται ένας .... .",
          "Η διαδικασία με την οποία οι οργανισμοί που είναι περισσότερο προσαρμοσμένοι στο περιβάλλον τους επιβιώνουν και αναπαράγονται περισσότερο από τους λιγότερο προσαρμοσμένους , ονομάστηκε απο τον Δαρβίνο .... .",
          "Το φαινόμενο το οποίο συσχετίστηκε με τη βιομηχανική ρύπανση ονομάστηκε .... .",
          "Οι καμηλοπαρδάλεις δημιουργήθηκαν από οργανισμούς κατώτερων βαθμίδων διαμέσου της .... .",
          "Τα αντιβιοτικά είναι χημικές ουσίες με αντιμικροβιακή δράση που παράγονται απο βακτήρια , μύκητες και φυτά.",
          "Τα αντιβιοτικά βλάπτουν τα κύτταρα του ανθρώπου.",
          "Τα αντιβιοτικά είναι αποτελεσματικά έναντι των ιών.",
          "Το δέρμα εμποδίζει αποτελεσματικά την είσοδο των μικροβίων στον οργανισμό.",
          "Τα Τ-λεμφοκύτταρα διαφοροποιούνται και ωριμάζουν στο μυελό των οστών.",
          "Η πρωτογενής ανοσοβιολογική απόκριση ενεργοποιείται κατά την πρώτη επαφή του οργανισμού με ένα αντιγόνο.",
          "Η εξειδίκευση είναι η ικανότητα του οργανισμού να θυμάται τα αντιγόνα με τα οποία έχει έλθει σε επαφή.",
          "Η δράση των βοηθητικών και των κυτταροτοξικών Τ-λεμφοκυττάρων αποτελεί την κυτταρική ανοσία.",
          "Η δευτερογενής ανοσοβιολογική απόκριση ενεργοποιείται κατά την επαφή του οργανισμού με το ίδιο αντιγόνο για δεύτερη (ή επόμενη) φορά.",
          "Τα πρωτόζωα είναι προκαρυωτικοί οργανισμοί.",
          "Οι μύκητες είναι ευκαρυωτικοί μονοκύτταροι ή πολυκύταρροι οργανισμοί .",
          "Η ιστολυτική αμοιβάδα προκαλεί αμοιβαδοειδή δυσεντερία.",
          "Τα φαγοκύτταρα αποτελούν μια κατηγορία ερυθρών αιμοσφαιριών.",
          "Τα πρωτογενή λεμφικά όργανα είναι οι λεμφαδένες, ο σπλήνας , οι αμυγδαλές και ο λεμφικός ιστός κατά το μήκος του γαστρεντερικού σωλήνα.",
          "Τα πρωτογενή λεμφικά όργανα είναι ο μυελός των οστών και ο θύμος αδένας.",
          "Η περιοχή του μορίου του αντισώματος που συνδέεται με την αντιγόνο ονομάζεται σταθερή περιοχή.",
          "Τα Β-λεμφοκύτταρα μνήμης ενεργοποιούνται αμέσως μετά από επόμενη έκθεση του οργανισμού στο ίδιο αντιγόνο.",
          "Τα αντιβιοτικά προκαλούν διαταραχές στη λειτουργία της πλασματικής μεμβράνης.",
          "Μια ασθένεια ΔΕΝ οφείλεται σε έναν παθογόνο μικροοργανισμό όταν ο μικροοργανισμός αυτός μπορεί να απομονώθει και να καλλιεργηθεί στο εργαστήριο.",
           "Οι παραγωγοί χαρακτηρίζονται και ως αυτότροφοι οργανισμοί.",
          "Οι ετερότροφοι οργανισμοί διακρίνονται σε καταναλωτές και αποικοδομητές.",
          "Οι αβιοτικοί παράγοντες ενός οικοσυστήματος είναι ανεξάρτητοι από τους βιοτικούς.",
          "Ένας από τους λόγους που ένα σύστημα μπορεί να ερημοποιηθεί είναι η καταστροφή από την όξινη βροχή.",
          "Τα ερημικά οικοσυστήματα βρίσκονται εκεί όπου η βρωχόπτωση είναι πολύ υψηλή.",
          "Τα μεσογειακά οικοσυστήματα δεν μπορούν να ανακάμψουν σε λιγότερο από δέκα χρόνια γιατί οι οργανισμοί τους έχουν προσαρμοστεί στην περιοδική εμφάνιση της φωτιάς αναπτύσσοντας συγκεκριμένους μηχανισμούς αναγέννησης.",
          "Μια από τις συνέπειες της φωτιάς είναι οτι αυξάνεται η διάβρωση του εδάφους.",
          "Ρύπανση είναι η επιβάρυνση του περιβάλλοντος με κάθε παράγοντα(ρύπο) που έχει βλαπτικές επιδράσεις στους οργανισμούς.",
          "Στους ρύπους δεν ανήκουν μορφές ενέργειας όπως η θερμότητα , ο ήχος και η ακτινοβολίες.",
          "Η ρύπανση ανάλογα με το τμήμα της βιόσφαιρας που πλήττει , διακρίνεται σε ατμοσφαιρική , σε ρύπανση των υδάτων και σε ρύπανση του εδάφους.",
          "Οι οργανισμοί ενός οικοσυστήματος οι οποίοι ανήκουν στο ίδιο είδος αποτελούν έναν βιότοπο.",
          "Το σύνολο των διαφορετικών πληθυσμών που ζουν σε ένα οικοσύστημα, αλλά και οι σχέσεις που αναπτύσσονται μεταξύ τους αποτελούν την βιοκοινότητα του οικοσυστήματος.",
          "Στους καταναλωτές ανήκουν ορισμένα βακτήρια και μύκητες που τρέφονται με την νεκρή οργανική ύλη.",
          "Στους καταναλωτές ανήκουν οι μονοκύτταροι και πολυκύτταροι ζωικοί οργανισμοί.",
          "Οι επαναλαμβανόμενες κυκλικές πορείες των χημικών στοιχείων στα οικοσυστήματα χαρακτηρίζονται ως χημικοί κύκλοι.",
          "Σημαντικότερα αζωτοδεσμευτικά βακτήρια είναι αυτά που ζουν συμβιωτικά στις ρίζες των ψυχανθών σε ειδικά εξογκώματα.",
          "Με τις κατακρημνίσεις το νερό απομακρύνεται από την ατμόσφαιρα και γίνεται διαθέσιμο στα υδάτινα και χερσαία οικοσυστήματα.",
          "Τα επιφανειακά ρέοντα ύδατα δεν απομακρύνουν τα θρεπτικά συστατικά τα οποία με μακροχρόνιες διαδικασίες γίνονται διαθέσιμα στους οργανισμούς.",
          "Η ανταλλαγή του νερού μεταξύ των ωκεανών και της ατμόσφαιρας αποτελεί έναν περίπλοκο μηχανισμό καθώς περιλαμβάνει πάρα πολλές διαδικασίες.",
          "Το τμήμα του κύκλου που αφορά την ξηρά είναι πιο απλό καθώς περιλαμβάνει μόνο τις διαδικασίες της εξάτμισης και των κατακρημνίσεων.",
          "Το τμήμα του κύκλου που αφορά την ξηρά είναι πιο περίπλοκο διότι οι πιθανές πορείες του νερού είναι περισσότερες.",
          "Ο Δαρβίνος ήταν ο πρώτος που διατύπωσε με επιστημονικούς όρους την ιδέα της εξέλιξης και επίσης υπέδειξε το μηχανισμό με τον οποίο αυτή συμβαίνει.",
         "Σήμερα η θεωρία της εξέλιξης δεν είναι αποδεκτή από το σύνολο της επιστημονικής κοινότητας.",
         "Η κυτταρική θεωρία υποστηρίζει ότι όλα τα έμβια όντα αποτελούνται απο κύτταρα και από προϊόντα κυττάρων.",
         "Η θεωρία της εξέλιξης υποστηρίζει ότι όλα τα έμβια όντα είναι προϊόντα εξέλιξης που υπέστησαν προγενέστεροι οργανισμοί.",
         "Όλοι οι οργανισμοί αναπαράγονται με την επαφή με άτομο διαφορετικού φύλου.",
         "Ο Λαμάρκ πίστευε οτι τα επίκτητα χαρακτηριστικά κληροδοτούνται στους απογόνους.",
         "Η 1η παρατήρηση του Δαρβίνου έλεγε οτι οι πληθυσμοί των διαφόρων ειδών τείνουν να μειώνονται από γενιά σε γενιά με ρυθμό γεωμετρικής προόδου.",
         "Η 2η παρατήρηση του Δαρβίνου έλεγε οτι αν εξαιρεθούν οι εποχικές διακυμάνσεις , τα μεγέθη των πληθυσμών παραμένουν σχετικά σταθερά.",
         "Η 3η παρατήρηση του Δαρβίνου έλεγε οτι τα άτομα ενός είδους είναι όμοια.",
         "Η 4η παρατήρηση του Δαρβίνου έλεγε οτι τα περισσότερα από τα χαρακτηριστικά των γονέων κληροδοτούνται στους απογόνους τους."
          };

        string[] shownArr = {
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false",
          "false"
          };

        string[] opt1Arr = {
          "ομοιόσταση",
          "μύκητες",
          "μύκητες",
          "μύκητες",
          "μυκητίαση",
          "μυκητίαση",
          "μυκητιάσεις",
          "τοξίνες",
          "παράσιτα",
          "παθογόνος",
          "προκαρυωτικοί",
          "τρυπανόσωμα",
          "τρυπανόσωμα",
          "τρυπανόσωμα",
          "βακτήρια",
          "έλυτρο",
          "έλυτρο",
          "τοξίνες",
          "τοξίνες",
          "τοξίνες",
          "συμπλήρωμα",
          "αμοιβάδα",
          "ανοσία",
          "εξειδίκευση",
          "αντιγόνο",
          "τροφικές αλυσίδες",
           "τροφικές αλυσίδες",
           "τροφική αλυσίδα",
           "τροφικές αλυσίδες",
           "καταναλωτές πρώτης τάξης",
           "καταναλωτές πρώτης τάξης",
           "καταναλωτές πρώτης τάξης",
           "βιολογικοί κύκλοι",
           "άνθρακας",
           "νιτροποίησης",
           "νιτροποιητική",
           "νιτροποιητική",
           "διαπνοή",
           "διαπνοηκή",
           "διαπνοή",
           "ετερότροφοι",
           "ετερότροφοι",
           "ετερότροφους",
           "βιότοπο",
           "συμπεριφορά",
           "βιότοπος",
           "κυτταρική",
           "κυτταρική θεωρία",
           "γένος",
           "νοητός αγώνας",
           "φυσική επιλογή",
           "βιομηχανική επανάσταση",
           "φυσικής επιλογής",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό",
           "Σωστό"

          };

        string[] op2Arr = {
          "ανάρρωση",
          "μικρόβια",
          "μικρόβια",
          "ξενιστές",
          "λοίμωξη",
          "λοίμωξη",
          "μολύνσεις",
          "ενδοτοξίνες",
          "ξενιστές",
          "ξενιστής",
          "ξενιστές",
          "τοξόπλασμα",
          "τοξόπλασμα",
          "τοξόπλασμα",
          "εκβλαστήματα",
          "τοξόπλασμα",
          "τοξόπλασμα",
          "ενδοτοξίνες",
          "ενδοτοξίνες",
          "ενδοτοξίνες",
          "καψίδιο",
          "προπερδίνη",
          "προσαρμογή",
          "προσαρμογή",
          "μικρόβιο",
           "τροφικές επιλογές",
           "τροφικές επιλογές",
           "τροφικό πλέγμα",
           "τροφικά πλέγματα",
           "παραγωγοί",
           "παραγωγοί",
           "παραγωγοί",
           "γεωλογικοί κύκλοι",
           "φώσφορος",
           "αζωτοδέσμευσης",
           "απονιτροποιητική",
           "απονιτροποιητική",
           "εξάτμιση",
           "νιτροποιητική",
           "εξάτμιση",
           "αυτότροφοι",
           "αυτότροφοι",
           "αυτότροφους",
           "πληθυσμό",
           "βιοσυμπεριφορά",
           "πληθυσμός",
            "δαρβινική",
           "δαρβινική θεωρία",
           "είδος",
           "φυσικός αγώνας",
           "εξέλιξη",
           "βιομηχανικός μελανισμός",
           "φυσικής εξέλιξης",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος",
           "Λάθος"
          };

        string[] op3Arr = {
          "υγεία",
          "βακτήρια",
          "βακτήρια",
          "ιοί",
          "ομοιόσταση",
          "ομοιόσταση",
          "ιώσεις",
          "εξωτοξίνες",
          "παθογόνοι",
          "πρωτόζωο",
          "παθογόνοι",
          "candida albicans",
          "candida albicans",
          "candida albicans",
          "δερματόφυτα",
          "εκβλάστημα",
          "εκβλάστημα",
          "εξωτοξίνες",
          "εξωτοξίνες",
          "εξωτοξίνες",
          "έλυτρο",
          "μνήμη",
          "μνήμη",
          "μνήμη",
          "παράσιτο",
          "τροφικές πυραμίδες",
           "τροφικές πυραμίδες",
           "τροφική πυραμίδα",
           "τροφική πυραμίδα",
           "καταναλωτές δεύτερης τάξης",
           "καταναλωτές δεύτερης τάξης",
           "καταναλωτές δεύτερης τάξης",
           "χημικοί κύκλοι",
           "σίδηρος",
           "απονιτροποίησης",
           "ατμοσφαιρική",
           "ατμοσφαιρική",
           "επιδερμία",
           "επιδερμική",
           "επιδερμία",
           "αποικοδομητές",
           "αποικοδομητές",
           "αποικοδομητές",
           "βιοτικό παράγοντα",
           "βιοκοινότητα",
           "βιοκοινότητα",
            "φυσική",
           "θεωρία της εξέλιξης",
           "φύλο",
           "αγώνας εξέλιξης",
           "κληρονομηκότητα",
           "εσωτερική δύναμη",
           "φυσικής κλίμακας",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x"
          };

        string[] op4Arr = {
          "ευεξία",
          "ιοί",
          "ιοί",
          "ενδοτοξίνες",
          "μόλυνση",
          "μόλυνση",
          "λοιμώδη νοσήματα",
          "μύκητες",
          "μικρόβια",
          "βακτήριο",
          "μολυσματικοί",
          "πλασμώδιο",
          "πλασμώδιο",
          "πλασμώδιο",
          "πλασμώδιο",
          "καψίδιο",
          "καψίδιο",
          "ιοί",
          "ιοί",
          "ανοσοσφαιρίνες",
          "πλασμοκύτταρο",
          "εξειδίκευση",
          "εξειδίκευση",
          "ανοσία",
          "πλασμώδιο",
          "τροφικές εναλλακτικές",
           "τροφικές εναλλακτικές",
           "τροφικό επίπεδο",
           "τροφικά επίπεδα",
           "καταναλωτές τρίτης τάξης",
           "καταναλωτές τρίτης τάξης",
           "καταναλωτές τρίτης τάξης",
           "βιογεωχημικοί κύκλοι",
           "ψευδάργυρος",
           "εξάτμισης",
           "βιολογική",
           "βιολογική",
           "αζωτοδέσμευσης",
           "αζωτοδεσμευτική",
           "αζωτοδέσμευση",
           "παραγωγοί",
           "παραγωγοί",
           "παραγωγούς",
           "αυτότροφο οργανισμό",
           "εξέλιξη",
           "οικοσύστημα",
            "λαμαρξική",
           "λαμαρξική θεωρία",
           "θέμα",
           "αγώνας επιβίωσης",
           "επιβίωση",
           "φυσική επιλογή",
           "φυσικής δύναμης",
            "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x",
           "x"
          };

        string[] ansArr = {
           "ομοιόσταση",
           "μικρόβια",
           "βακτήρια",
           "ιοί",
           "μόλυνση",
           "λοίμωξη",
           "λοιμώδη νοσήματα",
           "τοξίνες",
           "παράσιτα",
           "ξενιστής",
           "παθογόνοι",
           "πλασμώδιο",
           "τρυπανόσωμα",
           "τοξόπλασμα",
           "δερματόφυτα",
           "καψίδιο",
           "έλυτρο",
           "ενδοτοξίνες",
           "εξωτοξίνες",
           "ανοσοσφαιρίνες",
           "συμπλήρωμα",
           "προπερδίνη",
           "μνήμη",
           "ανοσία",
           "αντιγόνο",
           "τροφικές αλυσίδες",
           "τροφικές πυραμίδες",
           "τροφικό πλέγμα",
           "τροφικά επίπεδα",
           "παραγωγοί",
           "καταναλωτές πρώτης τάξης",
           "καταναλωτές δεύτερης τάξης",
           "βιογεωχημικοί κύκλοι",
           "άνθρακας",
           "αζωτοδέσμευσης",
           "ατμοσφαιρική",
           "βιολογική",
           "εξάτμιση",
           "επιδερμική",
           "διαπνοή",
           "παραγωγοί",
           "ετερότροφοι",
           "αποικοδομητές",
           "πληθυσμό",
           "βιοκοινότητα",
           "βιότοπος",
           "κυτταρική",
           "θεωρία της εξέλιξης",
           "είδος",
           "αγώνας επιβίωσης",
           "φυσική επιλογή",
           "βιομηχανικός μελανισμός",
           "φυσικής κλίμακας",
           "Σ",
        "Λ",
        "Λ",
        "Σ",
        "Λ",
        "Σ",
        "Λ",
        "Σ",
        "Σ",
        "Λ",
        "Σ",
        "Σ",
        "Λ",
        "Λ",
        "Σ",
        "Λ",
        "Σ",
        "Σ",
        "Λ",
         "Σ",
        "Σ",
        "Λ",
        "Σ",
        "Λ",
        "Λ",
        "Σ",
        "Σ",
        "Λ",
        "Σ",
        "Λ",
        "Σ",
        "Λ",
        "Σ",
        "Λ",
        "Σ",
        "Σ",
        "Λ",
        "Λ",
        "Λ",
        "Σ",
        "Σ",
        "Λ",
        "Σ",
        "Σ",
        "Λ",
        "Σ",
        "Λ",
        "Σ",
        "Λ",
        "Σ"
          };

        private void Quiz_Load(object sender, EventArgs e)
        {
            selectRandomQuestion();
            questions();
            progressBar1.Maximum = 10;
            progressBar1.Minimum = 0;
            this.progressBar1.Increment(1);
            timer1.Start();
        }
        int selectedQuestion;

        void selectRandomQuestion()
        {
            Random rnd = new Random();
            selectedQuestion = rnd.Next(1, qArr.Length);
            if (shownArr[selectedQuestion] == "false")
            {
                presentSelectedQuestion();
                shownArr[selectedQuestion] = "true";
            }
            else
            {
                selectRandomQuestion();
            }

        }

        void presentSelectedQuestion()
        {
            label1.Text = qArr[selectedQuestion];
        }

        void questions()
        {
            button2.Text = opt1Arr[selectedQuestion];
            button3.Text = op2Arr[selectedQuestion];
            button4.Text = op3Arr[selectedQuestion];
            button5.Text = op4Arr[selectedQuestion];
            if(ansArr[selectedQuestion] == "Σ" || ansArr[selectedQuestion] == "Λ")
            {
                button4.Visible = false;
                button5.Visible = false;
            }
            else
            {
                button4.Visible = true;
                button5.Visible = true;
            }
        }
        int totalQuestions = 0;
        private void button2_Click(object sender, EventArgs e)
        {
            if (button2.Text == ansArr[selectedQuestion])
            {

                selectRandomQuestion();
                questions();
                progressBar1.Maximum = 10;
                progressBar1.Minimum = 0;
                this.progressBar1.Increment(1);
                label3.Text = Convert.ToString(Convert.ToInt32(label3.Text) + 1);

                check();
                totalQuestions++;

            }
            else
            {
                selectRandomQuestion();
                questions();
                progressBar1.Maximum = 10;
                progressBar1.Minimum = 0;
                this.progressBar1.Increment(1);
                check();
                totalQuestions++;
            }
 }

        private void button3_Click(object sender, EventArgs e)
        {
            if (button3.Text == ansArr[selectedQuestion])
            {

                selectRandomQuestion();
                questions();
                progressBar1.Maximum = 10;
                progressBar1.Minimum = 0;
                this.progressBar1.Increment(1);
                label3.Text = Convert.ToString(Convert.ToInt32(label3.Text) + 1);

                check();
                totalQuestions++;

            }
            else
            {
                selectRandomQuestion();
                questions();
                progressBar1.Maximum = 10;
                progressBar1.Minimum = 0;
                this.progressBar1.Increment(1);
                check();
                totalQuestions++;
            }
        }

        private void button4_Click(object sender, EventArgs e)
        {
            if (button4.Text == ansArr[selectedQuestion])
            {

                selectRandomQuestion();
                questions();
                progressBar1.Maximum = 10;
                progressBar1.Minimum = 0;
                this.progressBar1.Increment(1);
                label3.Text = Convert.ToString(Convert.ToInt32(label3.Text) + 1);

                check();
                totalQuestions++;

            }
            else
            {
                selectRandomQuestion();
                questions();
                progressBar1.Maximum = 10;
                progressBar1.Minimum = 0;
                this.progressBar1.Increment(1);
                check();
                totalQuestions++;
            }
        }

        private void button5_Click(object sender, EventArgs e)
        {
            if (button5.Text == ansArr[selectedQuestion])
            {

                selectRandomQuestion();
                questions();
                progressBar1.Maximum = 10;
                progressBar1.Minimum = 0;
                this.progressBar1.Increment(1);
                label3.Text = Convert.ToString(Convert.ToInt32(label3.Text) + 1);

                check();
                totalQuestions++;

            }
            else
            {
                selectRandomQuestion();
                questions();
                progressBar1.Maximum = 10;
                progressBar1.Minimum = 0;
                this.progressBar1.Increment(1);
                check();
                totalQuestions++;
            }
        }
        void check()
        {
            if (totalQuestions == 9)
            {
                if (Convert.ToInt32(label3.Text) >= 6)
                {
                    Form1 form1 = new Form1();
                    form1.Show();
                    Visible = false;
                    MessageBox.Show("Συμπλήρωσες το quiz. Το σκορ που πέτυχες είναι: " + label3.Text + " Μπράβο σου! Πέρασες");
                   
                    timer1.Stop();
                }
                else
                {
                    Form1 form1 = new Form1();
                    form1.Show();
                    Visible = false;
                    MessageBox.Show("Συμπλήρωσες το quiz. Το σκορ που πέτυχες είναι: " + label3.Text + " Δυστυχώς κόπηκες! Ξαναπροσπάθησε!");
                   
                    timer1.Stop();
                }
            }

        }

        private void timer1_Tick(object sender, EventArgs e)
        {
            int timer = Convert.ToInt32(label5.Text);
            timer = timer-1;
            label5.Text = Convert.ToString(timer);
            if (timer == 0)
            {
                timer1.Stop();

                if (Convert.ToInt32(label3.Text) >= 6)
                {
                    Form1 form1 = new Form1();
                    form1.Show();
                    Visible = false;
                    MessageBox.Show("Ο χρόνος σου τελείωσε. Το σκορ που πέτυχες είναι: " + label3.Text + " Μπράβο σου! Πέρασες");
                 
                }
                else
                {
                    Form1 form1 = new Form1();
                    form1.Show();
                    Visible = false;
                    MessageBox.Show("Ο χρόνος σου τελείωσε. Το σκορ που πέτυχες είναι: " + label3.Text + " Δυστυχώς κόπηκες! Ξαναπροσπάθησε!");
                  
                }
            }
        }
    }
}
